app/controllers/application_controller.rb

SELECT "noticias".* FROM "noticias" ORDER BY updated_at desc LIMIT 30 OFFSET 0
---
  def home
    #@users = User.all
    @noticia = Noticia.new
    @roles = Role.all
    @noticias = Noticia.paginate(:page => params[:page])